import turtle
tao = turtle.Pen()#เรียกหน้าต่างวาดรูปขึ้นมา
tao.shape('turtle')#แปลงหัวปากกาให้เป็นรูปเต่า
turtle.bgcolor('black')#เปลี่ยนสีพื้นหลังให้เป็นสีดำ

###################################

for i in range(12): #ให้วาดซ้ำในภายใต้คำสั่ง 12 รอบ
    tao.speed(500) #เพิ่มความเร็ว 500
    tao.color("yellow", "red") #เปลี่ยนสีเส้นที่วาดเป็นสีเหลืองและสีในวงที่กำหนดให้เป็นสีแดง
    tao.begin_fill() #สร้างสีในฟิวที่กำหนดให้เป็นสีแดง
    tao.lt(50) #หันหัวเต่าไปทางซ้าย
    tao.circle(100) #วาดวงกลม 100 วง
    tao.end_fill() #จบการใส่สีในฟิว
    tao.color("blue") #เปลี่ยนสีเส้นที่วาด สีน้ำเงิน
    tao.rt(45) #หันหัวเต่าไปทางขวา
    tao.circle(75)
    tao.rt(45)
    tao.fd(150) #ให้เต่าเดินตรงวาดรูปไปด้านหน้า
    for i in range(6): #ให้วาดซ้ำในภายใต้คำสั่ง 6 รอบ
        tao.speed(300)
        tao.color("peru") #เปลี่ยนสีเส้นที่วาด สีน้ำตาลคาราเมล
        tao.fd(150) 
        tao.lt(50)
